import { Text } from '../../../../../pages/PublicOfferPage';
import { Container } from '../../../../Container/Container.styled';
import Subtitle from '../../../Subtitle/Subtitle';

export default function PaymentInfo() {
  return (
    <Container>
    <Subtitle accent center>
    Оплата
  </Subtitle>
  <Text>
    Накладений платіж або оплата на розрахунковий рахунок магазину
  </Text>
  <Text $accent>Оплата на розрахунковий рахунок магазину</Text>
  <Text>
    Для оплати через розрахунковий рахунок слід дотримуватися наступних
    кроків:
  </Text>
  <Text>
    1. Під час оформлення замовлення на сайті, оберіть спосіб оплати "Оплата
    на рахунок".
  </Text>
  <Text>
    2. Після цього, на вашу електронну пошту вказану при оформленні
    замовлення, буде надіслано листа з номером замовлення та номером рахунку.
  </Text>
  <Text>
    3. При оплаті замовлення, в описі платежу вкажіть номер вашого замовлення.
  </Text>
  <Text>
    4. Замовлення буде відправлене у найбліжчій час!
  </Text>
  <Text $accent>Накладений платіж</Text>
  <Text>
    1. Під час оформлення замовлення на сайті, оберіть спосіб оплати "Накладений платіж".
  </Text>
  <Text>
    2. Після цього, на вашу електронну пошту вказану при оформленні
    замовлення, буде надіслано листа з номером замовлення та переліком товару.
  </Text>
  <Text>
    3. Наш працівник зв'яжеться з вами у робочі години, для підтвердження деталей замовлення.
  </Text>
  <Text>
    4. Замовлення буде відправлене у найбліжчій час!
  </Text>
</Container>
  )
}
