import React from "react";
import { Container } from "../components/Container/Container.styled";
import Subtitle from "../components/Home/Subtitle/Subtitle";
import { Text } from "./PublicOfferPage";

export default function InfoPage() {
  return (
    <Container>
      <Subtitle accent center>
        Доставка
      </Subtitle>
      <Text>
        Доставка Новою Поштою або самовивіз у м. Одеса
      </Text>
      <Text $accent>
        Доставка Новою Поштою
      </Text>
      <Text>
        Оплата за доставку не входить в суму замовлення, та буде прорахована перевізником. 
      </Text>
      <Text>
        Доставка здійснюється 1-2 дні. 
      </Text>
      <Text $accent>
        Самовивіз у м. Одеса
      </Text>
      <Text>
        Ви можете самостійно забрати ваше замовлення у офлайн магазині "Кінтсугі" за адресою:
      </Text>
      <Text $accent>
        Грецька площа 3/4, ТЦ Афіна 4-й поверх 459 магазин
      </Text>
      <Text>
        Для цього при оформленні замовлення оберіть "самовивіз"
      </Text>
      <Subtitle accent center>
        Оплата
      </Subtitle>
      <Text>
        Накладений платіж або оплата на розрахунковий рахунок магазину
      </Text>
      <Text $accent>Оплата на розрахунковий рахунок магазину</Text>
      <Text>
        Для оплати через розрахунковий рахунок слід дотримуватися наступних
        кроків:
      </Text>
      <Text>
        1. Під час оформлення замовлення на сайті, оберіть спосіб оплати "Оплата
        на рахунок".
      </Text>
      <Text>
        2. Після цього, на вашу електронну пошту вказану при оформленні
        замовлення, буде надіслано листа з номером замовлення та номером рахунку.
      </Text>
      <Text>
        3. При оплаті замовлення, в описі платежу вкажіть номер вашого замовлення.
      </Text>
      <Text>
        4. Замовлення буде відправлене у найбліжчій час!
      </Text>
      <Text $accent>Накладений платіж</Text>
      <Text>
        1. Під час оформлення замовлення на сайті, оберіть спосіб оплати "Накладений платіж".
      </Text>
      <Text>
        2. Після цього, на вашу електронну пошту вказану при оформленні
        замовлення, буде надіслано листа з номером замовлення та переліком товару.
      </Text>
      <Text>
        3. Наш працівник зв'яжеться з вами у робочі години, для підтвердження деталей замовлення.
      </Text>
      <Text>
        4. Замовлення буде відправлене у найбліжчій час!
      </Text>
    </Container>
  );
}
