import React from "react";
import { Container } from "../components/Container/Container.styled";
import Title from "../components/Home/Title/Title";
import { Link, Text } from "./PublicOfferPage";

export default function Politic() {
  return (
    <Container>
      <Title text={"Політика приватності"} />
      <Text $accent>
        1. Персональні дані Покупця, що використовуються на Сайті{" "}
        <Link>https://kintsugi.org.ua</Link>, можуть включати:
      </Text>
      <Text>- прізвище, ім'я, по батькові;</Text>
      <Text>- адресу електронної пошти;</Text>
      <Text>- номер телефону;</Text>
      <Text>- адресу проживання (доставки);</Text>
      <Text>- перелік і статус замовлень з профілю на Сайті;</Text>
      <Text>
        - інформацію (у тому числі фото), розміщена в профілі і у
        відгуках/коментарях на Сайті;
      </Text>
      <Text>- файли cookie та дані про використання Сайту;</Text>
      <Text>
        - дані для здійснення розрахунків, які передаються фінансовим партнерам:
        паспортні дані та / або реєстраційний номер облікової картки платника
        податків (ідентифікаційний код), реквізити банківської картки (перші
        чотири і останні дві цифри), інші дані, передані на запит адміністратора
        для використання Покупцями можливостей, що надаються їм на Сайті.
      </Text>
      <Text $accent>
        2. У передбачених на Сайті випадках (спрощена процедура оплати
        банківською карткою, оплата частинами (в кредит), готівкою, з
        перевищенням встановленої законодавством суми, інші особливі умови
        отримання або оплати продукції, повернення коштів за повернуту продукцію
        і т.д.) від Покупця може знадобитися вчинення додаткових дій, надання
        додаткових даних та/або документів щодо себе, зокрема:
      </Text>
      <Text>надання інформації про адресу проживання;</Text>
      <Text>
        додавання в свій профіль реквізитів банківської карти, банківського
        (карткового) рахунку для перерахування коштів у зв'язку із замовленням
        або поверненням Продукції;
      </Text>
      <Text>
        надання паспортних даних та реєстраційного номера облікової картки
        платника податків (ідентифікаційного коду).
      </Text>
      <Text $accent>
        3. Ненадання (неповне надання) Покупцем персональних даних, які
        відповідно до встановлених алгоритмів роботи Сайту необхідні для
        виконання операцій, що були замовлені Покупцем, вважається відмовою
        Покупця від здійснення таких операцій і від вимоги здійснення
        адміністратором Сайту, Продавцем або фінансовим партнером будь-яких дій
        на користь покупця, обумовлених змістом таких операцій.
      </Text>
      <Text $accent>
        4. Адміністратор може збирати інформацію, яку браузер Покупця направляє
        кожен раз, коли останній відвідує Сайт, або коли отримує доступ до Сайту
        (далі - дані про використання).
      </Text>
      <Text $accent>
        5. Дані про використання можуть містити таку інформацію, як адреса
        інтернет-протоколу комп'ютера Покупця (наприклад, IP-адреса), тип
        браузера, версію інтернет-браузера, сторінки Сайту, які відвідує
        Покупець, час і дата відвідування, час, витрачений на ці сторінки,
        унікальний ідентифікатор пристрою та інші діагностичні дані.
      </Text>
      <Text $accent>
        6. Якщо Покупець отримує доступ до Сайту через Додаток, дані про
        використання можуть містити інформацію про тип використовуваного
        мобільного пристрою, унікальний ідентифікатор мобільного пристрою,
        IP-адреса мобільного пристрою, мобільну операційну систему, тип
        мобільного інтернет-браузера та інші діагностичні дані.
      </Text>
      <Text $accent>
        7. Адміністратор використовує файли cookie і аналогічні технології
        відстеження, щоб відстежувати діяльність Сайту і активність Покупців при
        його відвідуванні.
      </Text>
      <Text $accent>
        8. Файли cookie направляються в браузер з веб-сайту і зберігаються на
        пристрої Покупця. Покупець може налаштувати свій браузер і відмовитися
        від усіх файлів cookie або вказати, коли файли cookie можуть
        направлятися. Однак, якщо Покупець не приймає файли cookie, він втрачає
        можливість користуватися деякими елементами Сайту.
      </Text>
      <Text $accent>
        9. Адміністратор Сайту має право обробляти зібрані персональні дані для
        наступних цілей:
      </Text>
      <Text>реєстрація Покупця на Сайті;</Text>
      <Text>забезпечення роботи Сайту або окремих його складових;</Text>
      <Text>
        повідомлення Покупця про послуги, новини і рекламні пропозиції шляхом
        відправки SMS, електронних повідомлень тощо;
      </Text>
      <Text>надання клієнтської підтримки;</Text>
      <Text>
        обробка замовлень, зроблених Покупцем на Сайті та передача даних
        відповідним партнерам, підприємствам і службам, які здійснюють доставку,
        забезпечують оплату і т.д., для належного виконання замовлення;
      </Text>
      <Text>
        забезпечення обміну коментарями/враженнями про вчинені покупках;
      </Text>
      <Text>
        забезпечення реалізації господарських, цивільно-правових, податкових
        відносин, ведення бухгалтерського обліку та здійснення операційної
        діяльності, необхідних для виконання замовлень Покупців.
      </Text>
      <Text $accent>
        10. Дані Покупців збираються і обробляються на території України у
        зв'язку з реалізацією Товарів/наданням послуг на території України
        виключно і відповідно до чинного законодавства України.
      </Text>
    </Container>
  );
}
